In [33]:
mn = int(input("Enter the number of matrix: "))
row = int(input("Enter the number of rows in each matrix: "))
col = int(input("Enter the number of columns in each matrix: "))
print ("The number of matrix is %i" %(mn) + ", with dimension %i" %(row) + "x%i" %(col))
print ("--------------------------------------------")

matrix = []
for m in range(mn):
    rd = []
    for r in range(row):
        cd = []
        for c in range(col):
            num = int(input("For matrix %i" %(m+1) + ", enter integer in row %i, " %(r+1) + " column %i : " %(c+1)))
            cd.append(num)
        rd.append(cd)
    print ("--------------------------------------------")
    matrix.append(rd)

matrix

Enter the number of matrix: 2
Enter the number of rows in each matrix: 2
Enter the number of columns in each matrix: 2
The number of matrix is 2, with dimension 2x2
--------------------------------------------
For matrix 1, enter integer in row 1,  column 1 : 1
For matrix 1, enter integer in row 1,  column 2 : 24
For matrix 1, enter integer in row 2,  column 1 : 5
For matrix 1, enter integer in row 2,  column 2 : 23
--------------------------------------------
For matrix 2, enter integer in row 1,  column 1 : 5
For matrix 2, enter integer in row 1,  column 2 : 3
For matrix 2, enter integer in row 2,  column 1 : 2
For matrix 2, enter integer in row 2,  column 2 : 1
--------------------------------------------

[[[1, 24], [5, 23]], [[5, 3], [2, 1]]]

In [34]:
mylist = ['10', '1,000', '51,000', '500', '63,000']

newlist = []
for n in mylist:
    temp = n.replace(",",'')
    newlist.append(temp)
newlist

['10', '1000', '51000', '500', '63000']

In [39]:
check = ['"werwe"', 'wqe"wqe','wedfgd']

new = []
for c in check:
    new.append(c.replace('"',''))
new

['werwe', 'wqewqe', 'wedfgd']

In [127]:
df1 = pd.DataFrame({'ids': [101,102,103],'vals': ['apple','java','python']})
df1

   ids    vals
0  101   apple
1  102    java
2  103  python

In [128]:
df = pd.DataFrame({'TEXT_DATA': [u'apple a day keeps doctor away', u'apple tree in my farm', u'python is not new language', 
                                 u'Learn python programming', u'java is second language']})
df

                       TEXT_DATA
0  apple a day keeps doctor away
1          apple tree in my farm
2     python is not new language
3       Learn python programming
4        java is second language

In [140]:
extr = '|'.join(x for x in df1['vals'])
df['vals'] = df['TEXT_DATA'].str.extract('('+ extr + ')', expand=False)
newdf = pd.merge(df, df1, on='vals', how='left')
newdf[['TEXT_DATA','ids']]

                       TEXT_DATA  ids
0  apple a day keeps doctor away  101
1          apple tree in my farm  101
2     python is not new language  103
3       Learn python programming  103
4        java is second language  102

In [150]:
df['new'] = df.TEXT_DATA.apply(lambda x: 'apple' in str(x))
df

                       TEXT_DATA    vals    new
0  apple a day keeps doctor away   apple   True
1          apple tree in my farm   apple   True
2     python is not new language  python  False
3       Learn python programming  python  False
4        java is second language    java  False

In [97]:
for i in df1['vals']:
    print (i)

apple
java
python

In [151]:
newdf

                       TEXT_DATA    vals  ids
0  apple a day keeps doctor away   apple  101
1          apple tree in my farm   apple  101
2     python is not new language  python  103
3       Learn python programming  python  103
4        java is second language    java  102

In [154]:
intList = [1, 5, 4, 9, 7, 2, 15]
def manipfunc(a):
    j = a.index(2)
    print ("j: ",j)
    a.append(6.08)
    print ("intList: ",a)
    a.remove(4)
    print ("intList: ",a)
    a.insert(2,67)
    print ("intList: ",a)
    g = a.pop(3)
    print ("g: ",g)
#     print(a)
#     print(j, g)
manipfunc(intList)

j:  5
intList:  [1, 5, 4, 9, 7, 2, 15, 6.08]
intList:  [1, 5, 9, 7, 2, 15, 6.08]
intList:  [1, 5, 67, 9, 7, 2, 15, 6.08]
g:  9

In [173]:
pr_list = ['1 FO-','2 IA-']
df = pd.DataFrame({'PartNumber':['ABC','DEF','1 FO-BLABLA','2 IA-EXAMPLE']})

extr = '|'.join(x for x in pr_list)
df['Prefix'] = df['PartNumber'].str.extract('('+ extr + ')', expand=False).fillna('')
df['PartNumber'] = df['PartNumber'].str.replace('|'.join(pr_list),'')
df
# df['Prefix']=df.PartNumber.str.extract(r'({})'.format('|'.join(pr_list))).fillna('')
# df.PartNumber=df.PartNumber.str.replace('|'.join(pr_list),'')
# print(df)

  PartNumber Prefix
0        ABC
1        DEF
2     BLABLA  1 FO-
3    EXAMPLE  2 IA-

In [2]:
string = input("enter string")
if "python" in string:
    print(string.replace("python",".python"))
else:
    print(string)

enter stringI love python
I love .python

In [12]:
a = 'DA115792C339A5E674416AB0559BF5CB8D38E88B1E71F4DFAE896EBD2D13ABB13FFB1DC687DCF0C270A8BF4861D2E6D26E74DC81C18EB53FD5C52AA691A8F16BDA4E1EB8009B00DCD61457E34C438F23EF3D1FD905CF689793CC1E02E1ECB6778A1E2720D416AC432959A8A3B20B43525A856C97E4D404065D1D30ADC74D012B27D00B0029AD3940CB2C9F2AB6C01D430F3A58584C5DB6C98839579AF2A8F90A5D80B5097D547105DF2D9F9485E9F2CCFD6F9ECDDBD562FE09EA81C19B18482BD483AEBAB8481EE208887909DDAE826629538F36E6A50CEECBF3462E9FFBDAC6363F3A9A56F31081EBF28AD0FCF288B0DB8CB44735B9D7E6D193D55C90767E83'
b = a.replace('D6','9F')
print (a.count('9F'))
print (b.count('9F'))

4
6

In [32]:
import string
import pandas as pd

d = dict.fromkeys(string.ascii_lowercase, 0).keys()
# groups = sorted(d)[:3]
# numList = range(0,4)
groups = sorted(d)[:20]
numList = range(0,25)

df = pd.DataFrame({'Number':sorted(numList)*len(groups), 'Group':sorted(groups)*len(numList)})
print(df)
# df.sort_values(['Group', 'Number'])

    Group  Number
0       a       0
1       b       1
2       c       2
3       d       3
4       e       4
5       f       5
6       g       6
7       h       7
8       i       8
9       j       9
10      k      10
11      l      11
12      m      12
13      n      13
14      o      14
15      p      15
16      q      16
17      r      17
18      s      18
19      t      19
20      a      20
21      b      21
22      c      22
23      d      23
24      e      24
25      f       0
26      g       1
27      h       2
28      i       3
29      j       4
..    ...     ...
470     k      20
471     l      21
472     m      22
473     n      23
474     o      24
475     p       0
476     q       1
477     r       2
478     s       3
479     t       4
480     a       5
481     b       6
482     c       7
483     d       8
484     e       9
485     f      10
486     g      11
487     h      12
488     i      13
489     j      14
490     k      15
491     l      16
492     m      17
493     n      18
494     o      19
495     p      20
496     q      21
497     r      22
498     s      23
499     t      24

[500 rows x 2 columns]

In [34]:
df1 = pd.DataFrame({"id":["1","2","3","4"],"text":["Hello world how are you people","Hello people I am fine people",
                                                 "Good Morning people","Good Evening"]})
df2 = pd.DataFrame({"id":["1","2","3","4"],"text":["Hello world how are you all","Hello everyone I am fine everyone",
                                                 "Good Afternoon people","Good Night"]})
print(df2)

  id                               text
0  1        Hello world how are you all
1  2  Hello everyone I am fine everyone
2  3              Good Afternoon people
3  4                         Good Night

In [79]:
for n,d1 in enumerate(df1['text']):
    a = (d1.split())
    b = (df2['text'][n].split())
    c = sorted(set(a).intersection(b), key=a.index)
    print(' '.join(c))

Hello world how are you
Hello I am fine
Good people
Good

In [76]:
res = []
for s1, s2 in zip(df1.text, df2.text):
    set_s1 = s1.split()
    set_int = set(set_s1).intersection(s2.split())
    s_int = sorted(set_int, key=set_s1.index)
    res.append(' '.join(s_int))

out = pd.DataFrame(res, columns=['Text'])
out

                      Text
0  Hello world how are you
1          Hello I am fine
2              Good people
3                     Good

In [60]:
for n in range(len(df1['text'])):
    print(list(set(df1['text'][n].split()) - set(df2['text'][n].split())),
          list(set(df2['text'][n].split()) - set(df1['text'][n].split())))

['people'] ['all']
['people'] ['everyone']
['Morning'] ['Afternoon']
['Evening'] ['Night']

In [82]:
data1 = pd.DataFrame({"FirstName":["Steven","Jane","Paul"],"LastName":["Smith","Brown","Gibson"],
                      "Email":["stevesmith1@gmail.com","jb155@yahoo.com","paulgibbs@outlook.com"]})
data2 = pd.DataFrame({"ID":["1028332982","1028820233","934943823"],"FirstName":["Steven","Jane","Paul"],
                      "LastName":["Smith","Brown","Gibson"],"IncompleteEmail":["s*****1@g*l.com","j******n@yahoo.com","p*****s@h****l.com"]})
data1

                   Email FirstName LastName
0  stevesmith1@gmail.com    Steven    Smith
1        jb155@yahoo.com      Jane    Brown
2  paulgibbs@outlook.com      Paul   Gibson

In [81]:
data2

  FirstName          ID     IncompleteEmail LastName
0    Steven  1028332982     s*****1@g*l.com    Smith
1      Jane  1028820233  j******n@yahoo.com    Brown
2      Paul   934943823  p*****s@h****l.com   Gibson

In [110]:
df_new = pd.merge(data1,data2, on=['FirstName','LastName'], how='inner')
mails = []
regex = "(\w{1})\D.*(\w{1}\@\w{1})\D.*(\w{1}[\.]\D.+)"
for d in range(len(df_new)):
    inmail = re.findall(regex,df_new.iloc[d]["IncompleteEmail"])
    commail = re.findall(regex,df_new.iloc[d]["Email"])
    if inmail == commail:
        mails.append([df_new.iloc[d]['ID'],df_new.iloc[d]["Email"]])
pd.DataFrame(mails, columns=["ID","Email"])

           ID                  Email
0  1028332982  stevesmith1@gmail.com

In [160]:
import pandas as pd
df_initial = pd.DataFrame([
("2018-05-25", 18, 14),
("2018-06-04", 19, 16),
("2018-06-15", 19, 18),
("2018-06-24", 21, 20),
("2018-07-10", 23, 23),
("2018-07-20", 25, 25),
("2018-08-01", 27, 29),
("2018-08-10", 28, 32),
("2018-08-22", 29, 35),
("2018-09-03", 29, 37),
("2018-09-25", 31, 48),
("2018-10-17", 34, 55),
("2018-11-10", 38, 63),
("2018-11-11", 39, 64),
("2018-12-10", 48, 77),
("2018-12-11", 49, 78),
("2019-01-11", 57, 88),
("2019-02-10", 63, 103),
("2019-02-24", 67, 111),
("2018-03-10", 69, 113),
("2019-03-11", 70, 115),
("2019-04-10", 80, 149),
("2019-05-11", 88, 209)],
columns=["date", "col1", "col2"])
df_initial

          date  col1  col2
0   2018-05-25    18    14
1   2018-06-04    19    16
2   2018-06-15    19    18
3   2018-06-24    21    20
4   2018-07-10    23    23
5   2018-07-20    25    25
6   2018-08-01    27    29
7   2018-08-10    28    32
8   2018-08-22    29    35
9   2018-09-03    29    37
10  2018-09-25    31    48
11  2018-10-17    34    55
12  2018-11-10    38    63
13  2018-11-11    39    64
14  2018-12-10    48    77
15  2018-12-11    49    78
16  2019-01-11    57    88
17  2019-02-10    63   103
18  2019-02-24    67   111
19  2018-03-10    69   113
20  2019-03-11    70   115
21  2019-04-10    80   149
22  2019-05-11    88   209

In [161]:
import time
conv = [time.strptime(s,"%Y-%m-%d") for s in df_initial['date']]
df_initial['day'] = [time.strftime("%d", c) for c in conv]
df_initial.loc[df_initial['day'] == '10', ['col1','col2']] = 'NaN'
df_initial[['date','col1','col2']]

          date col1 col2
0   2018-05-25   18   14
1   2018-06-04   19   16
2   2018-06-15   19   18
3   2018-06-24   21   20
4   2018-07-10  NaN  NaN
5   2018-07-20   25   25
6   2018-08-01   27   29
7   2018-08-10  NaN  NaN
8   2018-08-22   29   35
9   2018-09-03   29   37
10  2018-09-25   31   48
11  2018-10-17   34   55
12  2018-11-10  NaN  NaN
13  2018-11-11   39   64
14  2018-12-10  NaN  NaN
15  2018-12-11   49   78
16  2019-01-11   57   88
17  2019-02-10  NaN  NaN
18  2019-02-24   67  111
19  2018-03-10  NaN  NaN
20  2019-03-11   70  115
21  2019-04-10  NaN  NaN
22  2019-05-11   88  209

In [13]:
x = "1234567890"
print(x[10::-1])
print(x[::-1])
print(x[0:10:1])

0987654321
0987654321
1234567890

In [6]:
z = 8620.73926
y = (z/100)
print(round(y))

86

In [14]:
import math
for i in range(0,7):
    z = math.pow(10,i)
    print(int(z))

1
10
100
1000
10000
100000
1000000

In [15]:
for i in (10 ** e for e in range(7)):
    print(i)

1
10
100
1000
10000
100000
1000000

In [18]:
a = 0
b = 0
c = 0
import math


def evaluate_quad_function(a, b, c, x):
    f_of_x = a * (x ** 2) + (b * x) + c
    return f_of_x  # return the calculated result


print("Welcome to the Quadratic Solver for f(x)=ax^2+bx+c")
a = input("Enter Value for a:")
b = input("Enter Value for b:")
c = input("Enter Value for c:")
# cannot do math on string, convert to float
a = float(a)
b = float(b)
c = float(c)
f_x0 = a * ((-b) / (2 * a) ** 2) + (b * (-b) / (2 * a)) + c


def print_sign(x):
    # check the sign if positive or negative
    return '+' if x > 0 else '-'


if a == 1:
    print("\nFunction is: f(x)= ", "x**2 ", print_sign(b), abs(b), "x ", print_sign(c), abs(c), sep="")
if b == 1:
    print("\nFunction is: f(x)= ", a, "x**2 ", print_sign(b), "x ", print_sign(c), abs(c), sep="")
if c == 1:
    print("\nFunction is: f(x)= ", a, "x**2 ", print_sign(b), abs(b), "x ", print_sign(c), abs(c), sep="")

x = input("Enter Value for x:")
x = float(x)

fx = evaluate_quad_function(a, b, c, x)
print("F" + "(" + str(x) + ")""=", str(fx))
temp = input("\nPress Enter to continue...")  # wait

x0 = -b / (2 * a)
x0 = float(x0)
if a > 0:
    print("f(x) has a minimum at " + str(x0) + " with a value f(x0)=" + str(f_x0))
else:
    print("f(x) has a maximum at " + str(x0) + " with a value f(x0)=" + str(f_x0))
temp = input("\nPress Enter to continue...")  # wait


def compute_discriminate():
    print("Solving for f(x) = 0")
    d = (b ** 2) - (4 * a * c)
    if d < 0:
        print("No real solution.")
    x1 = (-b + math.sqrt(d)) / (2 * a)
    x2 = (-b - math.sqrt(d)) / (2 * a)
    print("Discriminant is", str(d))
    if d > 0:
        (print("Two Real Solutions", str(x1), "and", str(x2)))

    if d == 0:
        print("One real solution:", str(x0))



print(compute_discriminate())

Welcome to the Quadratic Solver for f(x)=ax^2+bx+c
Enter Value for a:2
Enter Value for b:5
Enter Value for c:-8
Enter Value for x:3
F(3.0)= 25.0

Press Enter to continue...
f(x) has a minimum at -1.25 with a value f(x0)=-14.875

Press Enter to continue...
Solving for f(x) = 0
Discriminant is 89.0
Two Real Solutions 1.1084952830141508 and -3.608495283014151
None

In [4]:
n = eval(input ("enter the rows for pattern: "))
temp = 1
for i in range(1,n+1):
    temp =1
    while temp <= i:
        print("*", end = '')
        temp += 1
    print('')

enter the rows for pattern: 5
*
**
***
****
*****